public class information {

}

/*1:equals= از این متد برای مقایسه دو شیی استفاده میشود
o1.equals(o2) که جواب ان یا درست است یا نادرست
فرق equals با == این است که eguals مقدار را مقایسه میکند ولی == ادرس را
به حروف بزرگ و کوچک حساس است
*/

/*2: Compareto = مقدار عددی برمیگرداند
اگر اولی از دومی بزرگتر بود مثبت
اگر دومی از اولی بزرگتر بود منفی
و اگر برابر بودند صفر
میتوانیم برای یک کلاس هم تعریف کنیم
public int comparto(other o){
    return Integer.compare(this.a,o.a);
    return this.s.compare(o.s);
 */

/*در برخی مواقع م یخواهیم یک آبجکت را ذخیره کنیم و در جای دیگر بازیابی کنیم. در این مواقع از
اینترفیس Serializable استفاده خواهیم کرد. برای این کار کلاس مد نظر باید اینترفیس Serializable را
پیادهسازی کند. در این حا لت با استفاده از کلا سهای FileOutputStream و ObjectOutputStream
میتوانید یک شی را در فایل ذخیره کنید. برای بازیابی هم م یتوانید از FileInputStream به همر اه
ObjectInputStream م یتوانید استفاده نمایید. یک نمونه از یک کلاسی که اینترفیس Serilizable را
پیادهسازی کرده ایجاد کنید و آن را ذخیره کنید.*/