package q3package;

public class q {
}

/*1.پکیج Default، پکیجی است که به‌صورت خودکار برای کلاس‌هایی که در هیچ پکیجی تعریف نشده‌اند، اختصاص داده می‌شود. این کلاس‌ها فقط در همان سطح در دسترس هستند.
 این کلاس در هیچ پکیجی نیست
public class DefaultClass {}
پکیج Named یک پکیج مشخص و تعریف‌شده است که با package مشخص می‌شود و کلاس‌ها داخل آن باید import شوند تا در خارج از پکیج قابل استفاده باشند.
package mypackage; // کلاس در یک پکیج خاص قرار دارد
public class NamedClass {}
 */

/*2.میتوان از یک کلاس فقط درون خود یک پکیج استفاده کرد
برای اینکار باید کلاس خود را پرایوت کنیم
نحوه پرایوت کردن هم به این شکل است که internalclass را مینویسسیم
از این کلاس فقط توی پکیج مورد نطر میتونیم استفاده کنیم
و نمیتوان از ان بیرون از پکیج استفاده کرد
 */

/*3. یک کلاس را فقط میشود در یک پکیح استفاده کرد
ولی میشه یک کلاس مشابه را با همان نام توی یه پکیح دیگه تعریف کرد
 */

/*4. اگه دو کلاس با نام یکسان توی دو تا پکیج مختلف باشن برای استفاده از کلاس مورد
نظر از اسم کامل پکیج میتونیم استفاده کنیم
باید اول یه ابچکت از پکیجمون درست کنیم بعدش با اون ابجکت به کلاسمون دسترسی پیدا کنیم
 */
/*5.می‌توان پکیج‌های تو در تو ایجاد کرد که به مدیریت بهتر ساختار پروژه کمک می‌کنند.
package company.department;

public class Employee {}
 */


